# Найдите сумму цифр трехзначного числа. 

n = input('Введите трехзначное число: ')

n1 = int(n[0])
n2 = int(n[1])
n3 = int(n[2])

print(f'Сумма цифр числа = {n1+n2+n3}.')