# Дан список чисел. Определите, сколько в нем встречается различных чисел.
# Input: [1, 1, 2, 0, -1, 3, 4, 4] Output: 6

numbers = [1, 1, 2, 0, -1, 3, 4, 4]

print(f'В списке встречается {len(set(numbers))} различных чисел.')